app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test 2"], ["description", "Tes test"], ["author", "KAtie Test"], ["created_at", "2018-11-20 15:37:25.572398"], ["updated_at", "2018-11-20 15:37:25.572398"]]

    def set_article_param
      @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]